**`nomis-production`** terraform plan on `pull_request` event [#3380](https://github.com/ministryofjustice/modernisation-platform-environments/actions/runs/4284474290)

```
Terraform will perform the following actions:

  # module.db_ec2_instance["preprod-nomis-db-2"].aws_cloudwatch_metric_alarm.this["oracle-batch-error"] will be destroyed
  # (because key ["oracle-batch-error"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "Oracle db is either in long-running batch or failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Oracle+Batch+alert for remediation steps." -> null
      - alarm_name                = "preprod-nomis-db-2-oracle-batch-error" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:preprod-nomis-db-2-oracle-batch-error" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {
          - "InstanceId" = "i-09e5dd23c7350d2ad"
          - "instance"   = "batch_error"
        } -> null
      - evaluation_periods        = 5 -> null
      - id                        = "preprod-nomis-db-2-oracle-batch-error" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "collectd_exec_value" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["preprod-nomis-db-2"].aws_cloudwatch_metric_alarm.this["oracle-batch-failure"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db has recorded a failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Batch+Failure for remediation steps."
      + alarm_name                            = "preprod-nomis-db-2-oracle-batch-failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-09e5dd23c7350d2ad"
          + "instance"   = "nomis_batch_failure_status"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["preprod-nomis-db-2"].aws_cloudwatch_metric_alarm.this["oracle-long-running-batch"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db has recorded a long-running batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4325966186/Long+Running+Batch for remediation steps."
      + alarm_name                            = "preprod-nomis-db-2-oracle-long-running-batch"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-09e5dd23c7350d2ad"
          + "instance"   = "nomis_long_running_batch"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["prod-nomis-db-2"].aws_cloudwatch_metric_alarm.this["oracle-batch-error"] will be destroyed
  # (because key ["oracle-batch-error"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "Oracle db is either in long-running batch or failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Oracle+Batch+alert for remediation steps." -> null
      - alarm_name                = "prod-nomis-db-2-oracle-batch-error" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:prod-nomis-db-2-oracle-batch-error" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {
          - "InstanceId" = "i-07bc32b124f81c896"
          - "instance"   = "batch_error"
        } -> null
      - evaluation_periods        = 5 -> null
      - id                        = "prod-nomis-db-2-oracle-batch-error" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "collectd_exec_value" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["prod-nomis-db-2"].aws_cloudwatch_metric_alarm.this["oracle-batch-failure"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db has recorded a failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Batch+Failure for remediation steps."
      + alarm_name                            = "prod-nomis-db-2-oracle-batch-failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-07bc32b124f81c896"
          + "instance"   = "nomis_batch_failure_status"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["prod-nomis-db-2"].aws_cloudwatch_metric_alarm.this["oracle-long-running-batch"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db has recorded a long-running batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4325966186/Long+Running+Batch for remediation steps."
      + alarm_name                            = "prod-nomis-db-2-oracle-long-running-batch"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-07bc32b124f81c896"
          + "instance"   = "nomis_long_running_batch"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["prod-nomis-db-3"].aws_cloudwatch_metric_alarm.this["oracle-batch-error"] will be destroyed
  # (because key ["oracle-batch-error"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "Oracle db is either in long-running batch or failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Oracle+Batch+alert for remediation steps." -> null
      - alarm_name                = "prod-nomis-db-3-oracle-batch-error" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:prod-nomis-db-3-oracle-batch-error" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {
          - "InstanceId" = "i-01d7fed5f74ff9f4c"
          - "instance"   = "batch_error"
        } -> null
      - evaluation_periods        = 5 -> null
      - id                        = "prod-nomis-db-3-oracle-batch-error" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "collectd_exec_value" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["prod-nomis-db-3"].aws_cloudwatch_metric_alarm.this["oracle-batch-failure"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db has recorded a failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Batch+Failure for remediation steps."
      + alarm_name                            = "prod-nomis-db-3-oracle-batch-failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-01d7fed5f74ff9f4c"
          + "instance"   = "nomis_batch_failure_status"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["prod-nomis-db-3"].aws_cloudwatch_metric_alarm.this["oracle-long-running-batch"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db has recorded a long-running batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4325966186/Long+Running+Batch for remediation steps."
      + alarm_name                            = "prod-nomis-db-3-oracle-long-running-batch"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-01d7fed5f74ff9f4c"
          + "instance"   = "nomis_long_running_batch"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.monitoring-sns-topic.aws_sns_topic_subscription.monitoring_subscriptions[0] will be created
  + resource "aws_sns_topic_subscription" "monitoring_subscriptions" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy                   = (sensitive value)
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:272983201692:mod-platform-nomis-monitoring-production"
    }

Plan: 7 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
